apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_clocks.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_clocks.h
 *
 * SPDX-License-Identifier: BSD-3-Clause
 * SPDX-FileCopyrightText: 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_CLOCKS_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_CLOCKS_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rp2040_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Clock index **************************************************************/

#define RP2040_CLOCKS_NDX_GPOUT0    0   /* Clock output to GPIO 21 */
#define RP2040_CLOCKS_NDX_GPOUT1    1   /* Clock output to GPIO 23 */
#define RP2040_CLOCKS_NDX_GPOUT2    2   /* Clock output to GPIO 24 */
#define RP2040_CLOCKS_NDX_GPOUT3    3   /* Clock output to GPIO 25 */
#define RP2040_CLOCKS_NDX_REF       4   /* Reference clock */
#define RP2040_CLOCKS_NDX_SYS       5   /* System clock */
#define RP2040_CLOCKS_NDX_PERI      6   /* Peripheral clock */
#define RP2040_CLOCKS_NDX_USB       7   /* USB clock */
#define RP2040_CLOCKS_NDX_ADC       8   /* ADC clock */
#define RP2040_CLOCKS_NDX_RTC       9   /* RTC clock */
#define RP2040_CLOCKS_NDX_MAX       10

/* Register offsets *********************************************************/

#define RP2040_CLOCKS_CLK_CTRL_OFFSET              0x000000  /* Clock control */
#define RP2040_CLOCKS_CLK_DIV_OFFSET               0x000004  /* Clock divisor */
#define RP2040_CLOCKS_CLK_SELECTED_OFFSET          0x000008  /* Indicates which src is currently selected */

#define RP2040_CLOCKS_CLK_NDX_CTRL_OFFSET(n)        ((n) * 12 + RP2040_CLOCKS_CLK_CTRL_OFFSET)
#define RP2040_CLOCKS_CLK_NDX_DIV_OFFSET(n)         ((n) * 12 + RP2040_CLOCKS_CLK_DIV_OFFSET)
#define RP2040_CLOCKS_CLK_NDX_SELECTED_OFFSET(n)    ((n) * 12 + RP2040_CLOCKS_CLK_SELECTED_OFFSET)

#define RP2040_CLOCKS_CLK_SYS_RESUS_CTRL_OFFSET    0x000078
#define RP2040_CLOCKS_CLK_SYS_RESUS_STATUS_OFFSET  0x00007c
#define RP2040_CLOCKS_FC0_REF_KHZ_OFFSET           0x000080  /* Reference clock frequency in kHz */
#define RP2040_CLOCKS_FC0_MIN_KHZ_OFFSET           0x000084  /* Minimum pass frequency in kHz. This is optional. Set to 0 if you are not using the pass/fail flags */
#define RP2040_CLOCKS_FC0_MAX_KHZ_OFFSET           0x000088  /* Maximum pass frequency in kHz. This is optional. Set to 0x1ffffff if you are not using the pass/fail flags */
#define RP2040_CLOCKS_FC0_DELAY_OFFSET             0x00008c  /* Delays the start of frequency counting to allow the mux to settle Delay is measured in multiples of the reference clock period */
#define RP2040_CLOCKS_FC0_INTERVAL_OFFSET          0x000090  /* The test interval is 0.98us * 2**interval, but let's call it 1us * 2**interval The default gives a test interval of 250us */
#define RP2040_CLOCKS_FC0_SRC_OFFSET               0x000094  /* Clock sent to frequency counter, set to 0 when not required Writing to this register initiates the frequency count */
#define RP2040_CLOCKS_FC0_STATUS_OFFSET            0x000098  /* Frequency counter status */
#define RP2040_CLOCKS_FC0_RESULT_OFFSET            0x00009c  /* Result of frequency measurement, only valid when status_done=1 */
#define RP2040_CLOCKS_WAKE_EN0_OFFSET              0x0000a0  /* enable clock in wake mode */
#define RP2040_CLOCKS_WAKE_EN1_OFFSET              0x0000a4  /* enable clock in wake mode */
#define RP2040_CLOCKS_SLEEP_EN0_OFFSET             0x0000a8  /* enable clock in sleep mode */
#define RP2040_CLOCKS_SLEEP_EN1_OFFSET             0x0000ac  /* enable clock in sleep mode */
#define RP2040_CLOCKS_ENABLED0_OFFSET              0x0000b0  /* indicates the state of the clock enable */
#define RP2040_CLOCKS_ENABLED1_OFFSET              0x0000b4  /* indicates the state of the clock enable */
#define RP2040_CLOCKS_INTR_OFFSET                  0x0000b8  /* Raw Interrupts */
#define RP2040_CLOCKS_INTE_OFFSET                  0x0000bc  /* Interrupt Enable */
#define RP2040_CLOCKS_INTF_OFFSET                  0x0000c0  /* Interrupt Force */
#define RP2040_CLOCKS_INTS_OFFSET                  0x0000c4  /* Interrupt status after masking & forcing */

/* Register definitions *****************************************************/

