apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_clocks.h
#define RP2040_CLOCKS_CLK_NDX_CTRL(n)       (RP2040_CLOCKS_BASE + RP2040_CLOCKS_CLK_NDX_CTRL_OFFSET(n))
#define RP2040_CLOCKS_CLK_NDX_DIV(n)        (RP2040_CLOCKS_BASE + RP2040_CLOCKS_CLK_NDX_DIV_OFFSET(n))
#define RP2040_CLOCKS_CLK_NDX_SELECTED(n)   (RP2040_CLOCKS_BASE + RP2040_CLOCKS_CLK_NDX_SELECTED_OFFSET(n))

#define RP2040_CLOCKS_CLK_GPOUT0_CTRL       (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_GPOUT0))
#define RP2040_CLOCKS_CLK_GPOUT0_DIV        (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_GPOUT0))
#define RP2040_CLOCKS_CLK_GPOUT0_SELECTED   (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_GPOUT0))
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL       (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_GPOUT1))
#define RP2040_CLOCKS_CLK_GPOUT1_DIV        (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_GPOUT1))
#define RP2040_CLOCKS_CLK_GPOUT1_SELECTED   (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_GPOUT1))
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL       (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_GPOUT2))
#define RP2040_CLOCKS_CLK_GPOUT2_DIV        (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_GPOUT2))
#define RP2040_CLOCKS_CLK_GPOUT2_SELECTED   (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_GPOUT2))
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL       (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_GPOUT3))
#define RP2040_CLOCKS_CLK_GPOUT3_DIV        (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_GPOUT3))
#define RP2040_CLOCKS_CLK_GPOUT3_SELECTED   (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_GPOUT3))
#define RP2040_CLOCKS_CLK_REF_CTRL          (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_REF))
#define RP2040_CLOCKS_CLK_REF_DIV           (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_REF))
#define RP2040_CLOCKS_CLK_REF_SELECTED      (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_REF))
#define RP2040_CLOCKS_CLK_SYS_CTRL          (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_SYS))
#define RP2040_CLOCKS_CLK_SYS_DIV           (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_SYS))
#define RP2040_CLOCKS_CLK_SYS_SELECTED      (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_SYS))
#define RP2040_CLOCKS_CLK_PERI_CTRL         (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_PERI))
#define RP2040_CLOCKS_CLK_PERI_SELECTED     (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_PERI))
#define RP2040_CLOCKS_CLK_USB_CTRL          (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_USB))
#define RP2040_CLOCKS_CLK_USB_DIV           (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_USB))
#define RP2040_CLOCKS_CLK_USB_SELECTED      (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_USB))
#define RP2040_CLOCKS_CLK_ADC_CTRL          (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_ADC))
#define RP2040_CLOCKS_CLK_ADC_DIV           (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_ADC))
#define RP2040_CLOCKS_CLK_ADC_SELECTED      (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_ADC))
#define RP2040_CLOCKS_CLK_RTC_CTRL          (RP2040_CLOCKS_CLK_NDX_CTRL(RP2040_CLOCKS_NDX_RTC))
#define RP2040_CLOCKS_CLK_RTC_DIV           (RP2040_CLOCKS_CLK_NDX_DIV(RP2040_CLOCKS_NDX_RTC))
#define RP2040_CLOCKS_CLK_RTC_SELECTED      (RP2040_CLOCKS_CLK_NDX_SELECTED(RP2040_CLOCKS_NDX_RTC))

#define RP2040_CLOCKS_CLK_SYS_RESUS_CTRL    (RP2040_CLOCKS_BASE + RP2040_CLOCKS_CLK_SYS_RESUS_CTRL_OFFSET)
#define RP2040_CLOCKS_CLK_SYS_RESUS_STATUS  (RP2040_CLOCKS_BASE + RP2040_CLOCKS_CLK_SYS_RESUS_STATUS_OFFSET)
#define RP2040_CLOCKS_FC0_REF_KHZ           (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_REF_KHZ_OFFSET)
#define RP2040_CLOCKS_FC0_MIN_KHZ           (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_MIN_KHZ_OFFSET)
#define RP2040_CLOCKS_FC0_MAX_KHZ           (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_MAX_KHZ_OFFSET)
#define RP2040_CLOCKS_FC0_DELAY             (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_DELAY_OFFSET)
#define RP2040_CLOCKS_FC0_INTERVAL          (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_INTERVAL_OFFSET)
#define RP2040_CLOCKS_FC0_SRC               (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_SRC_OFFSET)
#define RP2040_CLOCKS_FC0_STATUS            (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_STATUS_OFFSET)
#define RP2040_CLOCKS_FC0_RESULT            (RP2040_CLOCKS_BASE + RP2040_CLOCKS_FC0_RESULT_OFFSET)
#define RP2040_CLOCKS_WAKE_EN0              (RP2040_CLOCKS_BASE + RP2040_CLOCKS_WAKE_EN0_OFFSET)
#define RP2040_CLOCKS_WAKE_EN1              (RP2040_CLOCKS_BASE + RP2040_CLOCKS_WAKE_EN1_OFFSET)
#define RP2040_CLOCKS_SLEEP_EN0             (RP2040_CLOCKS_BASE + RP2040_CLOCKS_SLEEP_EN0_OFFSET)
#define RP2040_CLOCKS_SLEEP_EN1             (RP2040_CLOCKS_BASE + RP2040_CLOCKS_SLEEP_EN1_OFFSET)
#define RP2040_CLOCKS_ENABLED0              (RP2040_CLOCKS_BASE + RP2040_CLOCKS_ENABLED0_OFFSET)
#define RP2040_CLOCKS_ENABLED1              (RP2040_CLOCKS_BASE + RP2040_CLOCKS_ENABLED1_OFFSET)
#define RP2040_CLOCKS_INTR                  (RP2040_CLOCKS_BASE + RP2040_CLOCKS_INTR_OFFSET)
#define RP2040_CLOCKS_INTE                  (RP2040_CLOCKS_BASE + RP2040_CLOCKS_INTE_OFFSET)
#define RP2040_CLOCKS_INTF                  (RP2040_CLOCKS_BASE + RP2040_CLOCKS_INTF_OFFSET)
#define RP2040_CLOCKS_INTS                  (RP2040_CLOCKS_BASE + RP2040_CLOCKS_INTS_OFFSET)

/* Register bit definitions *************************************************/

#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_NUDGE                  (1 << 20)  /* An edge on this signal shifts the phase of the output by 1 cycle of the input clock This can be done at any time */
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_PHASE_SHIFT            (16)       /* This delays the enable signal by up to 3 cycles of the input clock This must be set before the clock is enabled to have any effect */
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_PHASE_MASK             (0x03 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_PHASE_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_DC50                   (1 << 12)  /* Enables duty cycle correction for odd divisors */
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_ENABLE                 (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_KILL                   (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT           (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_MASK            (0x0f << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLKSRC_PLL_SYS  (0x0 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLKSRC_GPIN0    (0x1 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLKSRC_GPIN1    (0x2 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLKSRC_PLL_USB  (0x3 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_ROSC_CLKSRC     (0x4 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_XOSC_CLKSRC     (0x5 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLK_SYS         (0x6 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLK_USB         (0x7 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLK_ADC         (0x8 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLK_RTC         (0x9 << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_CLK_REF         (0xa << RP2040_CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_SHIFT)

