apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_clocks.h
#define RP2040_CLOCKS_CLK_GPOUT0_DIV_INT_SHIFT               (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_GPOUT0_DIV_INT_MASK                (0xffffff << RP2040_CLOCKS_CLK_GPOUT0_DIV_INT_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT0_DIV_FRAC_MASK               (0xff)     /* Fractional component of the divisor */

#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_NUDGE                  (1 << 20)  /* An edge on this signal shifts the phase of the output by 1 cycle of the input clock This can be done at any time */
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_PHASE_SHIFT            (16)       /* This delays the enable signal by up to 3 cycles of the input clock This must be set before the clock is enabled to have any effect */
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_PHASE_MASK             (0x03 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_PHASE_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_DC50                   (1 << 12)  /* Enables duty cycle correction for odd divisors */
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_ENABLE                 (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_KILL                   (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT           (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_MASK            (0x0f << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLKSRC_PLL_SYS  (0x0 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLKSRC_GPIN0    (0x1 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLKSRC_GPIN1    (0x2 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLKSRC_PLL_USB  (0x3 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_ROSC_CLKSRC     (0x4 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_XOSC_CLKSRC     (0x5 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLK_SYS         (0x6 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLK_USB         (0x7 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLK_ADC         (0x8 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLK_RTC         (0x9 << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_CLK_REF         (0xa << RP2040_CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_SHIFT)

#define RP2040_CLOCKS_CLK_GPOUT1_DIV_INT_SHIFT               (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_GPOUT1_DIV_INT_MASK                (0xffffff << RP2040_CLOCKS_CLK_GPOUT1_DIV_INT_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT1_DIV_FRAC_MASK               (0xff)     /* Fractional component of the divisor */

#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_NUDGE                  (1 << 20)  /* An edge on this signal shifts the phase of the output by 1 cycle of the input clock This can be done at any time */
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_PHASE_SHIFT            (16)       /* This delays the enable signal by up to 3 cycles of the input clock This must be set before the clock is enabled to have any effect */
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_PHASE_MASK             (0x03 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_PHASE_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_DC50                   (1 << 12)  /* Enables duty cycle correction for odd divisors */
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_ENABLE                 (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_KILL                   (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT           (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_MASK            (0x0f << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLKSRC_PLL_SYS  (0x0 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLKSRC_GPIN0    (0x1 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLKSRC_GPIN1    (0x2 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLKSRC_PLL_USB  (0x3 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_ROSC_CLKSRC_PH  (0x4 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_XOSC_CLKSRC     (0x5 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLK_SYS         (0x6 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLK_USB         (0x7 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLK_ADC         (0x8 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLK_RTC         (0x9 << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_CLK_REF         (0xa << RP2040_CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_SHIFT)

#define RP2040_CLOCKS_CLK_GPOUT2_DIV_INT_SHIFT               (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_GPOUT2_DIV_INT_MASK                (0xffffff << RP2040_CLOCKS_CLK_GPOUT2_DIV_INT_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT2_DIV_FRAC_MASK               (0xff)     /* Fractional component of the divisor */

#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_NUDGE                  (1 << 20)  /* An edge on this signal shifts the phase of the output by 1 cycle of the input clock This can be done at any time */
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_PHASE_SHIFT            (16)       /* This delays the enable signal by up to 3 cycles of the input clock This must be set before the clock is enabled to have any effect */
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_PHASE_MASK             (0x03 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_PHASE_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_DC50                   (1 << 12)  /* Enables duty cycle correction for odd divisors */
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_ENABLE                 (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_KILL                   (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT           (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_MASK            (0x0f << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLKSRC_PLL_SYS  (0x0 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLKSRC_GPIN0    (0x1 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLKSRC_GPIN1    (0x2 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLKSRC_PLL_USB  (0x3 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_ROSC_CLKSRC_PH  (0x4 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_XOSC_CLKSRC     (0x5 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLK_SYS         (0x6 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLK_USB         (0x7 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLK_ADC         (0x8 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLK_RTC         (0x9 << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_CLK_REF         (0xa << RP2040_CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_SHIFT)

#define RP2040_CLOCKS_CLK_GPOUT3_DIV_INT_SHIFT               (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_GPOUT3_DIV_INT_MASK                (0xffffff << RP2040_CLOCKS_CLK_GPOUT3_DIV_INT_SHIFT)
#define RP2040_CLOCKS_CLK_GPOUT3_DIV_FRAC_MASK               (0xff)     /* Fractional component of the divisor */

#define RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_SHIFT              (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_MASK               (0x03 << RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_CLKSRC_PLL_USB     (0x0 << RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_CLKSRC_GPIN0       (0x1 << RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_CLKSRC_GPIN1       (0x2 << RP2040_CLOCKS_CLK_REF_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_REF_CTRL_SRC_MASK                  (0x03)
#define RP2040_CLOCKS_CLK_REF_CTRL_SRC_ROSC_CLKSRC_PH        (0x0)
#define RP2040_CLOCKS_CLK_REF_CTRL_SRC_CLKSRC_CLK_REF_AUX    (0x1)
#define RP2040_CLOCKS_CLK_REF_CTRL_SRC_XOSC_CLKSRC           (0x2)

#define RP2040_CLOCKS_CLK_REF_DIV_INT_SHIFT                  (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_REF_DIV_INT_MASK                   (0x03 << RP2040_CLOCKS_CLK_REF_DIV_INT_SHIFT)

