apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_clocks.h
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT              (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_MASK               (0x07 << RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_CLKSRC_PLL_SYS     (0x0 << RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_CLKSRC_PLL_USB     (0x1 << RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_ROSC_CLKSRC        (0x2 << RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_XOSC_CLKSRC        (0x3 << RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_CLKSRC_GPIN0       (0x4 << RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_CLKSRC_GPIN1       (0x5 << RP2040_CLOCKS_CLK_SYS_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_CTRL_SRC                       (1 << 0)
#define RP2040_CLOCKS_CLK_SYS_CTRL_SRC_CLKSRC_CLK_SYS_AUX    (0x1)

#define RP2040_CLOCKS_CLK_SYS_DIV_INT_SHIFT                  (8)  /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_SYS_DIV_INT_MASK                   (0xffffff << RP2040_CLOCKS_CLK_SYS_DIV_INT_SHIFT)
#define RP2040_CLOCKS_CLK_SYS_DIV_FRAC_MASK                  (0xff)     /* Fractional component of the divisor */

#define RP2040_CLOCKS_CLK_PERI_CTRL_ENABLE                   (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_PERI_CTRL_KILL                     (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT             (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_MASK              (0x07 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_CLK_SYS           (0x0 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_CLKSRC_PLL_SYS    (0x1 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_CLKSRC_PLL_USB    (0x2 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_ROSC_CLKSRC_PH    (0x3 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_XOSC_CLKSRC       (0x4 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_CLKSRC_GPIN0      (0x5 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_CLKSRC_GPIN1      (0x6 << RP2040_CLOCKS_CLK_PERI_CTRL_AUXSRC_SHIFT)

#define RP2040_CLOCKS_CLK_USB_CTRL_NUDGE                     (1 << 20)  /* An edge on this signal shifts the phase of the output by 1 cycle of the input clock This can be done at any time */
#define RP2040_CLOCKS_CLK_USB_CTRL_PHASE_SHIFT               (16)       /* This delays the enable signal by up to 3 cycles of the input clock This must be set before the clock is enabled to have any effect */
#define RP2040_CLOCKS_CLK_USB_CTRL_PHASE_MASK                (0x03 << RP2040_CLOCKS_CLK_USB_CTRL_PHASE_SHIFT)
#define RP2040_CLOCKS_CLK_USB_CTRL_ENABLE                    (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_USB_CTRL_KILL                      (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT              (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_MASK               (0x07 << RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_CLKSRC_PLL_USB     (0x0 << RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_CLKSRC_PLL_SYS     (0x1 << RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_ROSC_CLKSRC_PH     (0x2 << RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_XOSC_CLKSRC        (0x3 << RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_CLKSRC_GPIN0       (0x4 << RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_CLKSRC_GPIN1       (0x5 << RP2040_CLOCKS_CLK_USB_CTRL_AUXSRC_SHIFT)

#define RP2040_CLOCKS_CLK_USB_DIV_INT_SHIFT                  (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_USB_DIV_INT_MASK                   (0x03 << RP2040_CLOCKS_CLK_USB_DIV_INT_SHIFT)

#define RP2040_CLOCKS_CLK_ADC_CTRL_NUDGE                     (1 << 20)  /* An edge on this signal shifts the phase of the output by 1 cycle of the input clock This can be done at any time */
#define RP2040_CLOCKS_CLK_ADC_CTRL_PHASE_SHIFT               (16)       /* This delays the enable signal by up to 3 cycles of the input clock This must be set before the clock is enabled to have any effect */
#define RP2040_CLOCKS_CLK_ADC_CTRL_PHASE_MASK                (0x03 << RP2040_CLOCKS_CLK_ADC_CTRL_PHASE_SHIFT)
#define RP2040_CLOCKS_CLK_ADC_CTRL_ENABLE                    (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_ADC_CTRL_KILL                      (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT              (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_MASK               (0x07 << RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_CLKSRC_PLL_USB     (0x0 << RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_CLKSRC_PLL_SYS     (0x1 << RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_ROSC_CLKSRC_PH     (0x2 << RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_XOSC_CLKSRC        (0x3 << RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_CLKSRC_GPIN0       (0x4 << RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_CLKSRC_GPIN1       (0x5 << RP2040_CLOCKS_CLK_ADC_CTRL_AUXSRC_SHIFT)

#define RP2040_CLOCKS_CLK_ADC_DIV_INT_SHIFT                  (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_ADC_DIV_INT_MASK                   (0x03 << RP2040_CLOCKS_CLK_ADC_DIV_INT_SHIFT)

#define RP2040_CLOCKS_CLK_RTC_CTRL_NUDGE                     (1 << 20)  /* An edge on this signal shifts the phase of the output by 1 cycle of the input clock This can be done at any time */
#define RP2040_CLOCKS_CLK_RTC_CTRL_PHASE_SHIFT               (16)       /* This delays the enable signal by up to 3 cycles of the input clock This must be set before the clock is enabled to have any effect */
#define RP2040_CLOCKS_CLK_RTC_CTRL_PHASE_MASK                (0x03 << RP2040_CLOCKS_CLK_RTC_CTRL_PHASE_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_CTRL_ENABLE                    (1 << 11)  /* Starts and stops the clock generator cleanly */
#define RP2040_CLOCKS_CLK_RTC_CTRL_KILL                      (1 << 10)  /* Asynchronously kills the clock generator */
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT              (5)        /* Selects the auxiliary clock source, will glitch when switching */
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_MASK               (0x07 << RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_CLKSRC_PLL_USB     (0x0 << RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_CLKSRC_PLL_SYS     (0x1 << RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_ROSC_CLKSRC_PH     (0x2 << RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_XOSC_CLKSRC        (0x3 << RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_CLKSRC_GPIN0       (0x4 << RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_CLKSRC_GPIN1       (0x5 << RP2040_CLOCKS_CLK_RTC_CTRL_AUXSRC_SHIFT)

#define RP2040_CLOCKS_CLK_RTC_DIV_INT_SHIFT                  (8)        /* Integer component of the divisor, 0 -> divide by 2^16 */
#define RP2040_CLOCKS_CLK_RTC_DIV_INT_MASK                   (0xffffff << RP2040_CLOCKS_CLK_RTC_DIV_INT_SHIFT)
#define RP2040_CLOCKS_CLK_RTC_DIV_FRAC_MASK                  (0xff)     /* Fractional component of the divisor */

#define RP2040_CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR               (1 << 16)  /* For clearing the resus after the fault that triggered it has been corrected */
#define RP2040_CLOCKS_CLK_SYS_RESUS_CTRL_FRCE                (1 << 12)  /* Force a resus, for test purposes only */
#define RP2040_CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE              (1 << 8)   /* Enable resus */
#define RP2040_CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_MASK        (0xff)     /* This is expressed as a number of clk_ref cycles and must be >= 2x clk_ref_freq/min_clk_tst_freq */

#define RP2040_CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED          (1 << 0)   /* Clock has been resuscitated, correct the error then send ctrl_clear=1 */

#define RP2040_CLOCKS_FC0_REF_KHZ_MASK                       (0xfffff)

