apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_clocks.h
#define RP2040_CLOCKS_FC0_MIN_KHZ_MASK                       (0x1ffffff)

#define RP2040_CLOCKS_FC0_MAX_KHZ_MASK                       (0x1ffffff)

#define RP2040_CLOCKS_FC0_DELAY_MASK                         (0x07)

#define RP2040_CLOCKS_FC0_INTERVAL_MASK                      (0x0f)

#define RP2040_CLOCKS_FC0_SRC_MASK                           (0xff)
#define RP2040_CLOCKS_FC0_SRC_NULL                           (0x0)
#define RP2040_CLOCKS_FC0_SRC_PLL_SYS_CLKSRC_PRIMARY         (0x1)
#define RP2040_CLOCKS_FC0_SRC_PLL_USB_CLKSRC_PRIMARY         (0x2)
#define RP2040_CLOCKS_FC0_SRC_ROSC_CLKSRC                    (0x3)
#define RP2040_CLOCKS_FC0_SRC_ROSC_CLKSRC_PH                 (0x4)
#define RP2040_CLOCKS_FC0_SRC_XOSC_CLKSRC                    (0x5)
#define RP2040_CLOCKS_FC0_SRC_CLKSRC_GPIN0                   (0x6)
#define RP2040_CLOCKS_FC0_SRC_CLKSRC_GPIN1                   (0x7)
#define RP2040_CLOCKS_FC0_SRC_CLK_REF                        (0x8)
#define RP2040_CLOCKS_FC0_SRC_CLK_SYS                        (0x9)
#define RP2040_CLOCKS_FC0_SRC_CLK_PERI                       (0xa)
#define RP2040_CLOCKS_FC0_SRC_CLK_USB                        (0xb)
#define RP2040_CLOCKS_FC0_SRC_CLK_ADC                        (0xc)
#define RP2040_CLOCKS_FC0_SRC_CLK_RTC                        (0xd)

#define RP2040_CLOCKS_FC0_STATUS_DIED                        (1 << 28)  /* Test clock stopped during test */
#define RP2040_CLOCKS_FC0_STATUS_FAST                        (1 << 24)  /* Test clock faster than expected, only valid when status_done=1 */
#define RP2040_CLOCKS_FC0_STATUS_SLOW                        (1 << 20)  /* Test clock slower than expected, only valid when status_done=1 */
#define RP2040_CLOCKS_FC0_STATUS_FAIL                        (1 << 16)  /* Test failed */
#define RP2040_CLOCKS_FC0_STATUS_WAITING                     (1 << 12)  /* Waiting for test clock to start */
#define RP2040_CLOCKS_FC0_STATUS_RUNNING                     (1 << 8)   /* Test running */
#define RP2040_CLOCKS_FC0_STATUS_DONE                        (1 << 4)   /* Test complete */
#define RP2040_CLOCKS_FC0_STATUS_PASS                        (1 << 0)   /* Test passed */

#define RP2040_CLOCKS_FC0_RESULT_KHZ_SHIFT                   (5)
#define RP2040_CLOCKS_FC0_RESULT_KHZ_MASK                    (0x1ffffff << RP2040_CLOCKS_FC0_RESULT_KHZ_SHIFT)
#define RP2040_CLOCKS_FC0_RESULT_FRAC_MASK                   (0x1f)

#define RP2040_CLOCKS_WAKE_EN0_clk_sys_sram3                 (1 << 31)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_sram2                 (1 << 30)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_sram1                 (1 << 29)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_sram0                 (1 << 28)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_spi1                  (1 << 27)
#define RP2040_CLOCKS_WAKE_EN0_clk_peri_spi1                 (1 << 26)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_spi0                  (1 << 25)
#define RP2040_CLOCKS_WAKE_EN0_clk_peri_spi0                 (1 << 24)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_sio                   (1 << 23)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_rtc                   (1 << 22)
#define RP2040_CLOCKS_WAKE_EN0_clk_rtc_rtc                   (1 << 21)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_rosc                  (1 << 20)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_rom                   (1 << 19)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_resets                (1 << 18)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_pwm                   (1 << 17)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_psm                   (1 << 16)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_pll_usb               (1 << 15)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_pll_sys               (1 << 14)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_pio1                  (1 << 13)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_pio0                  (1 << 12)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_pads                  (1 << 11)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_vreg_and_chip_reset   (1 << 10)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_jtag                  (1 << 9)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_io                    (1 << 8)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_i2c1                  (1 << 7)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_i2c0                  (1 << 6)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_dma                   (1 << 5)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_busfabric             (1 << 4)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_busctrl               (1 << 3)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_adc                   (1 << 2)
#define RP2040_CLOCKS_WAKE_EN0_clk_adc_adc                   (1 << 1)
#define RP2040_CLOCKS_WAKE_EN0_clk_sys_clocks                (1 << 0)

#define RP2040_CLOCKS_WAKE_EN1_clk_sys_xosc                  (1 << 14)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_xip                   (1 << 13)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_watchdog              (1 << 12)
#define RP2040_CLOCKS_WAKE_EN1_clk_usb_usbctrl               (1 << 11)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_usbctrl               (1 << 10)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_uart1                 (1 << 9)
#define RP2040_CLOCKS_WAKE_EN1_clk_peri_uart1                (1 << 8)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_uart0                 (1 << 7)
#define RP2040_CLOCKS_WAKE_EN1_clk_peri_uart0                (1 << 6)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_timer                 (1 << 5)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_tbman                 (1 << 4)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_sysinfo               (1 << 3)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_syscfg                (1 << 2)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_sram5                 (1 << 1)
#define RP2040_CLOCKS_WAKE_EN1_clk_sys_sram4                 (1 << 0)

#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_sram3                (1 << 31)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_sram2                (1 << 30)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_sram1                (1 << 29)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_sram0                (1 << 28)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_spi1                 (1 << 27)
#define RP2040_CLOCKS_SLEEP_EN0_clk_peri_spi1                (1 << 26)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_spi0                 (1 << 25)
#define RP2040_CLOCKS_SLEEP_EN0_clk_peri_spi0                (1 << 24)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_sio                  (1 << 23)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_rtc                  (1 << 22)
#define RP2040_CLOCKS_SLEEP_EN0_clk_rtc_rtc                  (1 << 21)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_rosc                 (1 << 20)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_rom                  (1 << 19)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_resets               (1 << 18)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_pwm                  (1 << 17)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_psm                  (1 << 16)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_pll_usb              (1 << 15)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_pll_sys              (1 << 14)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_pio1                 (1 << 13)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_pio0                 (1 << 12)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_pads                 (1 << 11)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_vreg_and_chip_reset  (1 << 10)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_jtag                 (1 << 9)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_io                   (1 << 8)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_i2c1                 (1 << 7)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_i2c0                 (1 << 6)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_dma                  (1 << 5)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_busfabric            (1 << 4)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_busctrl              (1 << 3)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_adc                  (1 << 2)
#define RP2040_CLOCKS_SLEEP_EN0_clk_adc_adc                  (1 << 1)
#define RP2040_CLOCKS_SLEEP_EN0_clk_sys_clocks               (1 << 0)

#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_xosc                 (1 << 14)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_xip                  (1 << 13)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_watchdog             (1 << 12)
#define RP2040_CLOCKS_SLEEP_EN1_clk_usb_usbctrl              (1 << 11)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_usbctrl              (1 << 10)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_uart1                (1 << 9)
#define RP2040_CLOCKS_SLEEP_EN1_clk_peri_uart1               (1 << 8)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_uart0                (1 << 7)
#define RP2040_CLOCKS_SLEEP_EN1_clk_peri_uart0               (1 << 6)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_timer                (1 << 5)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_tbman                (1 << 4)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_sysinfo              (1 << 3)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_syscfg               (1 << 2)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_sram5                (1 << 1)
#define RP2040_CLOCKS_SLEEP_EN1_clk_sys_sram4                (1 << 0)

#define RP2040_CLOCKS_ENABLED0_clk_sys_sram3                 (1 << 31)
#define RP2040_CLOCKS_ENABLED0_clk_sys_sram2                 (1 << 30)
#define RP2040_CLOCKS_ENABLED0_clk_sys_sram1                 (1 << 29)
#define RP2040_CLOCKS_ENABLED0_clk_sys_sram0                 (1 << 28)
#define RP2040_CLOCKS_ENABLED0_clk_sys_spi1                  (1 << 27)
#define RP2040_CLOCKS_ENABLED0_clk_peri_spi1                 (1 << 26)
#define RP2040_CLOCKS_ENABLED0_clk_sys_spi0                  (1 << 25)
#define RP2040_CLOCKS_ENABLED0_clk_peri_spi0                 (1 << 24)
#define RP2040_CLOCKS_ENABLED0_clk_sys_sio                   (1 << 23)
#define RP2040_CLOCKS_ENABLED0_clk_sys_rtc                   (1 << 22)
#define RP2040_CLOCKS_ENABLED0_clk_rtc_rtc                   (1 << 21)
#define RP2040_CLOCKS_ENABLED0_clk_sys_rosc                  (1 << 20)
#define RP2040_CLOCKS_ENABLED0_clk_sys_rom                   (1 << 19)
#define RP2040_CLOCKS_ENABLED0_clk_sys_resets                (1 << 18)
#define RP2040_CLOCKS_ENABLED0_clk_sys_pwm                   (1 << 17)
#define RP2040_CLOCKS_ENABLED0_clk_sys_psm                   (1 << 16)
#define RP2040_CLOCKS_ENABLED0_clk_sys_pll_usb               (1 << 15)
#define RP2040_CLOCKS_ENABLED0_clk_sys_pll_sys               (1 << 14)
#define RP2040_CLOCKS_ENABLED0_clk_sys_pio1                  (1 << 13)
#define RP2040_CLOCKS_ENABLED0_clk_sys_pio0                  (1 << 12)
#define RP2040_CLOCKS_ENABLED0_clk_sys_pads                  (1 << 11)
#define RP2040_CLOCKS_ENABLED0_clk_sys_vreg_and_chip_reset   (1 << 10)
#define RP2040_CLOCKS_ENABLED0_clk_sys_jtag                  (1 << 9)
#define RP2040_CLOCKS_ENABLED0_clk_sys_io                    (1 << 8)
#define RP2040_CLOCKS_ENABLED0_clk_sys_i2c1                  (1 << 7)
#define RP2040_CLOCKS_ENABLED0_clk_sys_i2c0                  (1 << 6)
#define RP2040_CLOCKS_ENABLED0_clk_sys_dma                   (1 << 5)
#define RP2040_CLOCKS_ENABLED0_clk_sys_busfabric             (1 << 4)
#define RP2040_CLOCKS_ENABLED0_clk_sys_busctrl               (1 << 3)
#define RP2040_CLOCKS_ENABLED0_clk_sys_adc                   (1 << 2)
#define RP2040_CLOCKS_ENABLED0_clk_adc_adc                   (1 << 1)
#define RP2040_CLOCKS_ENABLED0_clk_sys_clocks                (1 << 0)

#define RP2040_CLOCKS_ENABLED1_clk_sys_xosc                  (1 << 14)
#define RP2040_CLOCKS_ENABLED1_clk_sys_xip                   (1 << 13)
#define RP2040_CLOCKS_ENABLED1_clk_sys_watchdog              (1 << 12)
#define RP2040_CLOCKS_ENABLED1_clk_usb_usbctrl               (1 << 11)
#define RP2040_CLOCKS_ENABLED1_clk_sys_usbctrl               (1 << 10)
#define RP2040_CLOCKS_ENABLED1_clk_sys_uart1                 (1 << 9)
#define RP2040_CLOCKS_ENABLED1_clk_peri_uart1                (1 << 8)
#define RP2040_CLOCKS_ENABLED1_clk_sys_uart0                 (1 << 7)
#define RP2040_CLOCKS_ENABLED1_clk_peri_uart0                (1 << 6)
#define RP2040_CLOCKS_ENABLED1_clk_sys_timer                 (1 << 5)
#define RP2040_CLOCKS_ENABLED1_clk_sys_tbman                 (1 << 4)
#define RP2040_CLOCKS_ENABLED1_clk_sys_sysinfo               (1 << 3)
#define RP2040_CLOCKS_ENABLED1_clk_sys_syscfg                (1 << 2)
#define RP2040_CLOCKS_ENABLED1_clk_sys_sram5                 (1 << 1)
#define RP2040_CLOCKS_ENABLED1_clk_sys_sram4                 (1 << 0)

#define RP2040_CLOCKS_INTR_CLK_SYS_RESUS                     (1 << 0)

#define RP2040_CLOCKS_INTE_CLK_SYS_RESUS                     (1 << 0)

#define RP2040_CLOCKS_INTF_CLK_SYS_RESUS                     (1 << 0)

#define RP2040_CLOCKS_INTS_CLK_SYS_RESUS                     (1 << 0)

#endif /* __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_CLOCKS_H */
